
## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/101063453/runs/d914c712-81dc-4d2d-b6ec-78a6646e6778).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>

## poc | default | Success :thumbsup:
**Dir**: poc
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_autoscaling_group.app will be created
+   resource "aws_autoscaling_group" "app" {
+       arn                              = (known after apply)
+       availability_zones               = (known after apply)
+       default_cooldown                 = (known after apply)
+       desired_capacity                 = 2
+       force_delete                     = false
+       force_delete_warm_pool           = false
+       health_check_grace_period        = 300
+       health_check_type                = (known after apply)
+       id                               = (known after apply)
+       ignore_failed_scaling_activities = false
+       load_balancers                   = (known after apply)
+       max_size                         = 3
+       metrics_granularity              = "1Minute"
+       min_size                         = 1
+       name                             = (known after apply)
+       name_prefix                      = "app-"
+       predicted_capacity               = (known after apply)
+       protect_from_scale_in            = false
+       region                           = "us-east-1"
+       service_linked_role_arn          = (known after apply)
+       target_group_arns                = (known after apply)
+       vpc_zone_identifier              = (known after apply)
+       wait_for_capacity_timeout        = "10m"
+       warm_pool_size                   = (known after apply)
+
       availability_zone_distribution (known after apply)
+
       capacity_reservation_specification (known after apply)
+
       launch_template (known after apply)
+
       mixed_instances_policy {
+           instances_distribution {
+               on_demand_allocation_strategy            = (known after apply)
+               on_demand_base_capacity                  = 0
+               on_demand_percentage_above_base_capacity = 0
+               spot_allocation_strategy                 = "price-capacity-optimized"
+               spot_instance_pools                      = (known after apply)
            }
+           launch_template {
+               launch_template_specification {
+                   launch_template_id   = (known after apply)
+                   launch_template_name = (known after apply)
+                   version              = "$Latest"
                }
+               override (known after apply)
            }
        }
+
       traffic_source (known after apply)
    }

  # aws_launch_template.app will be created
+   resource "aws_launch_template" "app" {
+       arn             = (known after apply)
+       default_version = (known after apply)
+       id              = (known after apply)
+       image_id        = "ami-068c0051b15cdb816"
+       instance_type   = "t3.medium"
+       latest_version  = (known after apply)
+       name            = (known after apply)
+       name_prefix     = "app-"
+       region          = "us-east-1"
+       tags_all        = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
+
       metadata_options (known after apply)
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       region                 = "us-east-1"
+       tags                   = {
+           "Name" = "poc-vpc-default"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)
+
       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }
+       egress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }
+
       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }
+       ingress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       region                 = "us-east-1"
+       route                  = (known after apply)
+       tags                   = {
+           "Name" = "poc-vpc-default"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)
+
       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       region                 = "us-east-1"
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "poc-vpc-default"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       region   = "us-east-1"
+       tags     = {
+           "Name" = "poc-vpc"
        }
+       tags_all = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc"
+           "Terraform"   = "true"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       region                 = "us-east-1"
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+
       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       region           = "us-east-1"
+       route            = (known after apply)
+       tags             = {
+           "Name" = "poc-vpc-private-us-east-1a"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       region           = "us-east-1"
+       route            = (known after apply)
+       tags             = {
+           "Name" = "poc-vpc-private-us-east-1b"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       region           = "us-east-1"
+       route            = (known after apply)
+       tags             = {
+           "Name" = "poc-vpc-private-us-east-1c"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-private-us-east-1c"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       region           = "us-east-1"
+       route            = (known after apply)
+       tags             = {
+           "Name" = "poc-vpc-public"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-public"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       region         = "us-east-1"
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       region         = "us-east-1"
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       region         = "us-east-1"
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       region         = "us-east-1"
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       region         = "us-east-1"
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       region         = "us-east-1"
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.21.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Name" = "poc-vpc-private-us-east-1a"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.22.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Name" = "poc-vpc-private-us-east-1b"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.23.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Name" = "poc-vpc-private-us-east-1c"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-private-us-east-1c"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Name" = "poc-vpc-public-us-east-1a"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-public-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Name" = "poc-vpc-public-us-east-1b"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-public-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.3.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Name" = "poc-vpc-public-us-east-1c"
        }
+       tags_all                                       = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc-public-us-east-1c"
+           "Terraform"   = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Name" = "poc-vpc"
        }
+       tags_all                             = {
+           "Environment" = "dev"
+           "Name"        = "poc-vpc"
+           "Terraform"   = "true"
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.

```

</details>

## Cost Estimation
**Total Monthly Difference: 14.45 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| poc | default | 11.68 | 26.13 | 14.45 |
| | **Total** | **11.68** | **26.13** | **14.45** |

</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>